In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic = pd.read_csv("D:/Study/Data Science Content/Datasets/Titanic/train.csv")

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Steps Invloved

1. Data Pre-Processing & Cleaning
2. Splitting Data into Training and Test Set
3. Applying all the above algorithms
4. Comparing the accuracy Scores

### 1. Data Preprocessing

Dataset : Titanic Dataset
Preprocessing Steps :
* Divide the Data into Two Data Frames: Categorical and Numerical 
** Categorical will contain all the columns from the data set which contain categories.** Numerical will contain all the columns from the data set which contain numbers.
* We will drop columns from the DataFrames if 
** Column is not important.
** Column Contains more than 80% Null values.

* Next we will take care of null values.
* If Null values are less than 80% in a column then we will replace it with the category having maximum count in the column (for Categorical Columns) or with the mean of the column (for numerical columns).
* If a column has around 60-80% null values, and we feel that the column is important, we can create a category replacing all the null values. 
* For the Numerical Columns, we will plot the box plot and see if there are any outliers. Then we will replace file outliers from the data as well.

### Categories Columns

In [4]:
titanic_cat = titanic.select_dtypes(object)

### Numerical Columns

In [5]:
titanic_num = titanic.select_dtypes(np.number)

In [6]:
titanic_cat.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [7]:
titanic_num.head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

##### We will going to drop some unwanted columns which are not important for model building.

In [8]:
titanic_cat.drop(['Name', 'Ticket'], axis = 1, inplace = True)
titanic_cat.head()

C:\Users\Prath\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

      Sex Cabin Embarked
0    male   NaN        S
1  female   C85        C
2  female   NaN        S
3  female  C123        S
4    male   NaN        S

#### In this step we will look at null values which is present in the above columns

In [9]:
titanic_cat.isna().sum()

Sex           0
Cabin       687
Embarked      2
dtype: int64

#### Now we will replace all the null values present with the maximum count category.

In [10]:
titanic_cat.Cabin.fillna(titanic_cat.Cabin.value_counts().idxmax(), inplace = True)
titanic_cat.Embarked.fillna(titanic_cat.Embarked.value_counts().idxmax(), inplace = True)

C:\Users\Prath\anaconda3\lib\site-packages\pandas\core\series.py:4463: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

In [11]:
titanic_cat.head(20)

       Sex        Cabin Embarked
0     male  C23 C25 C27        S
1   female          C85        C
2   female  C23 C25 C27        S
3   female         C123        S
4     male  C23 C25 C27        S
5     male  C23 C25 C27        Q
6     male          E46        S
7     male  C23 C25 C27        S
8   female  C23 C25 C27        S
9   female  C23 C25 C27        C
10  female           G6        S
11  female         C103        S
12    male  C23 C25 C27        S
13    male  C23 C25 C27        S
14  female  C23 C25 C27        S
15  female  C23 C25 C27        S
16    male  C23 C25 C27        Q
17    male  C23 C25 C27        S
18  female  C23 C25 C27        S
19  female  C23 C25 C27        C

#### Now, the next step will be to replace all the categories will Numerical columns.
#### We will use LabelEncoders Method.

In [12]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
titanic_cat = titanic_cat.apply(le.fit_transform)

In [13]:
titanic_cat.head()

   Sex  Cabin  Embarked
0    1     63         2
1    0     81         0
2    0     63         2
3    0     55         2
4    1     63         2

#### Now we will work on Numerical DataFrame.

In [14]:
titanic_num.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Age            177
SibSp            0
Parch            0
Fare             0
dtype: int64

#### Only one column contains Null values. We will replace null values with Mean value of that columns which is 'Age'.

In [15]:
titanic_num.Age.fillna(titanic_num.Age.mean(), inplace = True)
titanic_num.isna().sum()

C:\Users\Prath\anaconda3\lib\site-packages\pandas\core\series.py:4463: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().fillna(

PassengerId    0
Survived       0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
dtype: int64

#### In following dataframe the 'PassengerId' column is not reqiured.

In [16]:
titanic_num.drop(['PassengerId'], axis = 1, inplace = True)
titanic_num.head()

C:\Users\Prath\anaconda3\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

   Survived  Pclass   Age  SibSp  Parch     Fare
0         0       3  22.0      1      0   7.2500
1         1       1  38.0      1      0  71.2833
2         1       3  26.0      0      0   7.9250
3         1       1  35.0      1      0  53.1000
4         0       3  35.0      0      0   8.0500

#### Now that we are done with Data Preprocessing Step, We will combine the two DataFrames and make it as one.

In [17]:
titanic_final = pd.concat([titanic_cat, titanic_num], axis = 1)
titanic_final.head()

   Sex  Cabin  Embarked  Survived  Pclass   Age  SibSp  Parch     Fare
0    1     63         2         0       3  22.0      1      0   7.2500
1    0     81         0         1       1  38.0      1      0  71.2833
2    0     63         2         1       3  26.0      0      0   7.9250
3    0     55         2         1       1  35.0      1      0  53.1000
4    1     63         2         0       3  35.0      0      0   8.0500

### 2. Splitting Data into Training and Testing Data.

#### Let's define our dependent and independent variables.
* Independent (x) will be remaining variables.
* Dependent (y) will be Survived.

In [18]:
X = titanic_final.drop(['Survived'], axis = 1)
Y = titanic_final['Survived']

In [19]:
X_train = np.array(X[0 : int(0.8 * len(X))])
Y_train = np.array(Y[0 : int(0.8 * len(Y))])

X_test = np.array(X[int(0.8 * len(X)):])
Y_test = np.array(Y[int(0.8 * len(Y)):])
len(X_train), len(Y_train), len(X_test), len(Y_test)

(712, 712, 179, 179)

#### Importing all the algorithms

In [20]:
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import LinearSVC
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier

### 3. Applying all the above algorithms

In [21]:
LR = LogisticRegression()
KNN = KNeighborsClassifier()
NB = GaussianNB()
LSVM = LinearSVC()
NLSVM = SVC(kernel = 'rbf')
DT = DecisionTreeClassifier()
RF = RandomForestClassifier()

#### Training The Data set

In [22]:
LR_fit = LR.fit(X_train, Y_train)
KNN_fit = KNN.fit(X_train, Y_train)
NB_fit = NB.fit(X_train, Y_train)
LSVM_fit = LSVM.fit(X_train, Y_train)
NLSVM_fit = NLSVM.fit(X_train, Y_train)
DT_fit = DT.fit(X_train, Y_train)
RF_fit = RF.fit(X_train, Y_train)

C:\Users\Prath\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(
C:\Users\Prath\anaconda3\lib\site-packages\sklearn\svm\_base.py:985: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  warnings.warn("Liblinear failed to converge, increase "

#### Predicting the values with following algorithms.

In [23]:
LR_pred = LR_fit.predict(X_test)

KNN_pred = KNN_fit.predict(X_test)
NB_pred = NB_fit.predict(X_test)
LSVM_pred = LSVM_fit.predict(X_test)
NLSVM_pred = NLSVM_fit.predict(X_test)
DT_pred = DT_fit.predict(X_test)
RF_pred = RF_fit.predict(X_test)

### 4. Comparing the accuracy Scores

In [24]:
from sklearn.metrics import accuracy_score

In [25]:
##### print("Logistic Regression is %f percent accurate" % (accuracy_score(LR_pred, Y_test)*100))
print("KNN is %f percent accurate" % (accuracy_score(KNN_pred, Y_test)*100))
print("Naive Bayes is %f percent accurate" % (accuracy_score(NB_pred, Y_test)*100))
print("Linear SVMs is %f percent accurate" % (accuracy_score(LSVM_pred, Y_test)*100))
print("Non Linear SVMs is %f percent accurate" % (accuracy_score(NLSVM_pred, Y_test)*100))
print("Decision Trees is %f percent accurate" % (accuracy_score(DT_pred, Y_test)*100))
print("Random Forests is %f percent accurate" % (accuracy_score(RF_pred, Y_test)*100))

KNN is 75.977654 percent accurate
Naive Bayes is 80.446927 percent accurate
Linear SVMs is 77.653631 percent accurate
Non Linear SVMs is 73.184358 percent accurate
Decision Trees is 82.122905 percent accurate
Random Forests is 83.240223 percent accurate